retobots/RETOCAR_Senior_Hospital_Robot/STM32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define ADC_Pin GPIO_PIN_0
#define ADC_GPIO_Port GPIOA
#define ENA_Pin GPIO_PIN_6
#define ENA_GPIO_Port GPIOA
#define TFT_DC_Pin GPIO_PIN_0
#define TFT_DC_GPIO_Port GPIOB
#define TFT_RST_Pin GPIO_PIN_1
#define TFT_RST_GPIO_Port GPIOB
#define MPU_INT_Pin GPIO_PIN_2
#define MPU_INT_GPIO_Port GPIOB
#define Motor_A1_Pin GPIO_PIN_12
#define Motor_A1_GPIO_Port GPIOB
#define Motor_A2_Pin GPIO_PIN_13
#define Motor_A2_GPIO_Port GPIOB
#define Motor_B1_Pin GPIO_PIN_14
#define Motor_B1_GPIO_Port GPIOB
#define Motor_B2_Pin GPIO_PIN_15
#define Motor_B2_GPIO_Port GPIOB
#define Encoder_A1_Pin GPIO_PIN_8
#define Encoder_A1_GPIO_Port GPIOA
#define Encoder_A2_Pin GPIO_PIN_9
#define Encoder_A2_GPIO_Port GPIOA
#define TFT_CS_Pin GPIO_PIN_10
#define TFT_CS_GPIO_Port GPIOA
#define BUZZER_Pin GPIO_PIN_3
#define BUZZER_GPIO_Port GPIOB
#define ENB_Pin GPIO_PIN_5
#define ENB_GPIO_Port GPIOB
#define Encoder_B1_Pin GPIO_PIN_6
#define Encoder_B1_GPIO_Port GPIOB
#define Encoder_B2_Pin GPIO_PIN_7
#define Encoder_B2_GPIO_Port GPIOB
#define SCL_Pin GPIO_PIN_8
#define SCL_GPIO_Port GPIOB
#define SDA_Pin GPIO_PIN_9
#define SDA_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
